#include <stdio.h>
#include <conio.h>


int main(void) {
	char board[10][10] = {
	{'#', '#', '#', '#', '.', '.', '.', '.', '.', '.' },

	{'.', '.', '.', '.', '.', '#', '.', '.', '.', '.' },

	{'#', '#', '#', '.', '#', '.', '.', '.', '.', '.' },

	{'.', '.', '#', '.', '.', '#', '.', '.', '.', '.' },

	{'.', '.', '#', '.', '.', '#', '.', '.', '.', '.' },

	{'.', '.', '#', '.', '.', '#', '.', '.', '.', '.' },

	{'.', '.', '.', '#', '.', '.', '#', '#', '.', '.' },

	{'.', '.', '.', '.', '#', '.', '.', '.', '#', '#' },

	{'.', '.', '.', '.', '.', '#', '.', '.', '.', '.' },

	{'.', '.', '.', '.', '.', '#', '#', '#', '#', '#' }
	};

	
	int x = 0, y = 1;
	board[y][x] = '@';

	while (1) {
		system("cls");

		printf("왼쪽:<-, 오른쪽:->, 위:^, 아래:v\n\n");

		for (int y = 0; y < 10; y++) {
			for (int x = 0; x < 10; x++) {
				printf("%c",board[y][x]);
			}
			printf("\n");
		}

		board[y][x] = '.';

		int ch = getch();
		if (ch == 224) {
			int ch2 = _getch();

			int xpos = x;
			int ypos = y;

			if (ch2 == 75) xpos--;
			else if (ch2 == 80) ypos++;
			else if (ch2 == 72) ypos--;
			else if (ch2 == 77) xpos++;

			//미로 범위체크 + 벽 체크
			if (xpos >= 0 && xpos < 10 && ypos >= 0 && ypos < 10) {
				if (board[ypos][xpos] != '#') {
					x = xpos;
					y = ypos;
				}
			}
		}

		board[y][x] = '@';; //새 위치 표시

	}


}